app/channels/terminal_dm_channel.rb

  def subscribed
    @session = TerminalSession.find_by(id: params[:session_id], user: current_user)
---
SELECT "terminal_sessions".* FROM "terminal_sessions" WHERE "terminal_sessions"."id" = $1 AND "terminal_sessions"."user_id" = $2 LIMIT $3  [["id", 11], ["user_id", 4], ["LIMIT", 1]]