app/services/ai_dm/tool_executor.rb

      state_after = capture_state

      # Create audit log
      DmActionAuditLog.create!(
        terminal_session: session,
        character: character,
        tool_name: tool_name,
        parameters: parameters,
        result: result,
        state_before: state_before,
        state_after: state_after,
        execution_status: result[:success] ? 'executed' : 'failed',
        trigger_source: options[:trigger_source] || 'ai',
        conversation_turn: options[:conversation_turn],
        execution_time_ms: execution_time_ms
      )
---
INSERT INTO "dm_action_audit_logs" ("terminal_session_id", "character_id", "dm_pending_action_id", "tool_name", "parameters", "result", "execution_status", "state_before", "state_after", "conversation_turn", "trigger_source", "created_at", "updated_at", "execution_time_ms") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"


      # Calculate initial HP
      die_size = char_class.hit_die&.gsub(/\D/, '')&.to_i || 8
      character.update!(
        hit_points_max: die_size + character.constitution_modifier,
        hit_points_current: die_size + character.constitution_modifier
      )
---
UPDATE "characters" SET "hit_points_current" = $1, "hit_points_max" = $2, "updated_at" = $3 WHERE "characters"."id" = $4  [["hit_points_current", 9], ["hit_points_max", 9], ["updated_at", "2025-11-21 04:35:28.017229"], ["id", 12]]

    def character_combat_tracker(char_id = nil)
      char = find_character(char_id)
      char&.character_combat_tracker || char&.create_character_combat_tracker
---
INSERT INTO "character_combat_trackers" ("character_id", "action_resources", "death_saves", "conditions", "resistances", "immunities", "vulnerabilities", "temp_hp", "exhaustion_level", "initiative_roll", "has_reaction", "has_bonus_action", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"