app/controllers/terminal_controller.rb

  def set_or_create_session
    # Try to find existing active session for the user
    if current_user
      @session = current_user.terminal_sessions.where(active: true).last
    end

    # Create new session if none found
    @session ||= TerminalSession.create!(
      user: current_user || guest_user,
      title: 'New Adventure',
      mode: 'creation',
      active: true
    )
---
INSERT INTO "users" ("email", "password_digest", "role", "discarded_at", "username", "bio", "avatar_url", "experience_points", "level", "preferences", "timezone", "last_active_at", "deleted_at", "created_at", "updated_at", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "sign_in_count", "current_sign_in_at", "last_sign_in_at", "current_sign_in_ip", "last_sign_in_ip", "guest", "display_name", "discord_id", "discord_username", "discord_discriminator", "discord_avatar", "discord_access_token", "discord_refresh_token", "discord_token_expires_at", "ai_tokens_used", "ai_tokens_limit", "ai_tokens_reset_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36) RETURNING "id"
INSERT INTO "terminal_sessions" ("user_id", "title", "mode", "active", "character_id", "dungeon_map_id", "solo_session_id", "map_render_mode", "show_map_panel", "command_history", "settings", "discord_channel_id", "discord_guild_id", "discord_thread_id", "created_at", "updated_at", "session_token", "campaign_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"

  def create_new_session
    # Deactivate any existing sessions
    current_user&.terminal_sessions&.update_all(active: false)

    TerminalSession.create!(
      user: current_user || guest_user,
      title: 'New Adventure',
      mode: 'creation',
      active: true
    )
---
INSERT INTO "terminal_sessions" ("user_id", "title", "mode", "active", "character_id", "dungeon_map_id", "solo_session_id", "map_render_mode", "show_map_panel", "command_history", "settings", "discord_channel_id", "discord_guild_id", "discord_thread_id", "created_at", "updated_at", "session_token") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"

  def create_guest_user
    guest_id = SecureRandom.hex(8)
    user = User.create!(
      email: "guest_#{guest_id}@terminal-dnd.local",
      username: "guest_#{guest_id}",
      password: SecureRandom.hex(16),
      guest: true
    )
---
INSERT INTO "users" ("email", "password_digest", "role", "discarded_at", "username", "bio", "avatar_url", "experience_points", "level", "preferences", "timezone", "last_active_at", "deleted_at", "created_at", "updated_at", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "sign_in_count", "current_sign_in_at", "last_sign_in_at", "current_sign_in_ip", "last_sign_in_ip", "guest", "display_name", "discord_id", "discord_username", "discord_discriminator", "discord_avatar", "discord_access_token", "discord_refresh_token", "discord_token_expires_at", "ai_tokens_used", "ai_tokens_limit", "ai_tokens_reset_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36) RETURNING "id"