app/models/terminal_session.rb

  def add_narrative(content, content_type: 'narrative', **options)
    narrative_outputs.create!(
      content: content,
      content_type: content_type,
      clickable_elements: options[:clickables] || [],
      memory_hints: options[:memory_hints] || [],
      speaker: options[:speaker],
      related_room_id: options[:room_id],
      related_npc_id: options[:npc_id]
    )
---
INSERT INTO "narrative_outputs" ("terminal_session_id", "content", "content_type", "clickable_elements", "rendered_html", "created_at", "updated_at", "memory_hints", "speaker", "related_room_id", "related_npc_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"